jamesweidev/tennis-robot/projects/03_mobile_ball_finder/firmware/STM32_ObjectAvoider/Core/Testing/Src/main.c
#include "main.h"
#include "stm32f446xx.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_tim.h"



void SystemClock_Config(void);
void Error_Handler(void);

void GPIO_Init(void);

int main(void)
{
	HAL_Init();
	SystemClock_Config();

	GPIO_Init();

	while (1)
	{

	}

	return 0;
}

void Encoder_TIM1_Init(void)
{
    TIM_HandleTypeDef htim1 = {0};

    htim1.Instance = TIM1;
    htim1.Init.Period = 0xFFFF;
    TIM_Encoder_InitTypeDef encoder_init = {0};
    encoder_init.EncoderMode = TIM_ENCODERMODE_TI12;
    encoder_init.IC1Selection

    HAL_TIM_Encoder_Init(&htim1, &encoder_init);   
}

void GPIO_Init(void)
{
	GPIO_InitTypeDef gpio_init = {0};

	gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
	gpio_init.Pin = GPIO_PIN_0;
	gpio_init.Pull = GPIO_NOPULL;
	gpio_init.Speed = GPIO_SPEED_FREQ_LOW;

	HAL_GPIO_Init(GPIOA, &gpio_init);
}

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc_init = {0};
    RCC_PLLInitTypeDef pll_init = {0};

    osc_init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc_init.HSEState = RCC_HSE_BYPASS;

    pll_init.PLLState = RCC_PLL_ON;
    pll_init.PLLSource = RCC_PLLSOURCE_HSE;
    pll_init.PLLM = 8;
    pll_init.PLLN = 100;
    pll_init.PLLP = 2;
    pll_init.PLLR = 2;
    pll_init.PLLQ = 2;

    osc_init.PLL = pll_init;

    if (HAL_RCC_OscConfig(&osc_init) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitTypeDef clk_init = {0};
    clk_init.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_SYSCLK;
    clk_init.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clk_init.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk_init.APB1CLKDivider = RCC_HCLK_DIV1;
    clk_init.APB2CLKDivider = RCC_HCLK_DIV2;

    if (HAL_RCC_ClockConfig(&clk_init, FLASH_LATENCY_1) != HAL_OK)
    {
        Error_Handler();
    }
}


// Debuging

void Error_Handler(void)
{
	while (1);
}

